tangyangguang/Esp32Base/src/web/internal/WebFs.cpp
bool scanFs(FsScan& scan) {
    memset(&scan, 0, sizeof(scan));
    return Esp32BaseFs::isReady() && fsWalkDir(scan, "/", 0, false, false, 0, nullptr);
}

bool fsManageMode() {
    return g_server.hasArg("manage") && g_server.arg("manage") != "0";
}

bool fsInternalUsageHigh(const FsScan& scan) {
    const uint64_t used = Esp32BaseFs::usedBytes();
    if (used <= scan.listedSize) {
        return false;
    }
    const uint64_t gap = used - scan.listedSize;
    return gap > 131072ULL && gap > scan.listedSize;
}

bool validFsFilePath(const char* path) {
    return path && path[0] == '/' && path[1] != '\0' && strlen(path) < 96 &&
           !strstr(path, "..") && !strstr(path, "//");
}

bool fsReadArg(const char* name, char* out, size_t len) {
    if (!out || len == 0 || !name || !g_server.hasArg(name)) {
        return false;
    }
    const String value = g_server.arg(name);
    if (value.length() >= len) {
        out[0] = '\0';
        return false;
    }
    strlcpy(out, value.c_str(), len);
    return true;
}

bool fsReadPathArg(const char* name, char* out, size_t len) {
    return fsReadArg(name, out, len) && validFsFilePath(out);
}

bool validFsDeletePath(const char* path) {
    return validFsFilePath(path);
}

bool validFsDirectoryPath(const char* path) {
    return path && ((strcmp(path, "/") == 0) || validFsFilePath(path));
}

bool fsUploadFilenameValid(const char* name) {
    if (!name || !name[0] || strlen(name) > 63 || strcmp(name, ".") == 0 || strcmp(name, "..") == 0) {
        return false;
    }
    for (const char* p = name; *p; ++p) {
        const unsigned char c = static_cast<unsigned char>(*p);
        if (c < 32 || c == 127 || *p == '/' || *p == '\\' || *p == ':') {
            return false;
        }
    }
    return !strstr(name, "..");
}

bool fsUploadDirectoryExists(const char* dir) {
    if (!validFsDirectoryPath(dir)) {
        return false;
    }
    if (strcmp(dir, "/") == 0) {
        return Esp32BaseFs::isReady();
    }
    return Esp32BaseFs::listDir(dir, fsNoopListCallback, nullptr);
}

bool fsBuildUploadPath(const char* dir, const char* name, char* out, size_t len) {
    if (!out || len == 0 || !validFsDirectoryPath(dir) || !fsUploadFilenameValid(name)) {
        return false;
    }
    int written = 0;
    if (strcmp(dir, "/") == 0) {
        written = snprintf(out, len, "/%s", name);
    } else {
        written = snprintf(out, len, "%s/%s", dir, name);
    }
    if (written <= 0 || static_cast<size_t>(written) >= len) {
        out[0] = '\0';
        return false;
    }
    return validFsFilePath(out);
}

void fsSetUploadError(const char* message) {
    strlcpy(g_fsUploadError, message && message[0] ? message : "upload failed", sizeof(g_fsUploadError));
}

void fsCloseUploadFile() {
    g_fsUploadActive = false;
    fsScanYield();
}

void fsResetUploadState() {
    g_fsUploadForbidden = false;
    g_fsUploadStartFailed = false;
    g_fsUploadReceived = false;
    g_fsUploadModified = false;
    g_fsUploadAppEventsTarget = false;
    g_fsUploadFileLogTarget = false;
    g_fsUploadActive = false;
    g_fsUploadOverwrite = false;
    g_fsUploadBytes = 0;
    g_fsUploadPath[0] = '\0';
    g_fsUploadError[0] = '\0';
}

bool fsReloadUploadRuntime(const char* path, bool appEventsTarget, bool fileLogTarget, const char** errorOut) {
    if (errorOut) {
        *errorOut = nullptr;
    }
    bool ok = true;
    (void)path;
    (void)appEventsTarget;
    (void)fileLogTarget;
#if ESP32BASE_ENABLE_APP_EVENTS
    if (appEventsTarget && !Esp32BaseAppEventLog::reload()) {
        ESP32BASE_LOG_W("web", "fs_upload_reload_failed path=%s target=app_events error=%s", path && path[0] ? path : "-", Esp32BaseAppEventLog::lastError());
        if (errorOut && !*errorOut) {
            *errorOut = "App Events store reload failed";
        }
        ok = false;
    }
#endif
#if ESP32BASE_ENABLE_FILELOG
    if (fileLogTarget && !Esp32BaseFileLog::begin()) {
        ESP32BASE_LOG_W("web", "fs_upload_reload_failed path=%s target=filelog", path && path[0] ? path : "-");
        if (errorOut && !*errorOut) {
            *errorOut = "FileLog reload failed";
        }
        ok = false;
    }
#endif
    return ok;
}

void fsRecoverModifiedUploadRuntime(const char* path, bool modified, bool appEventsTarget, bool fileLogTarget) {
    if (!modified || (!appEventsTarget && !fileLogTarget)) {
        return;
    }
    const char* ignoredError = nullptr;
    fsReloadUploadRuntime(path, appEventsTarget, fileLogTarget, &ignoredError);
}

bool fsUploadTargetIsDirectory(const char* path) {
    return validFsFilePath(path) && Esp32BaseFs::listDir(path, fsNoopListCallback, nullptr);
}

bool fsUploadFileReadableEnd(const char* path, uint64_t size) {
    if (size == 0) {
        return true;
    }
    if (size > UINT32_MAX) {
        return false;
    }
    uint8_t value = 0;
    size_t readLen = 0;
    return Esp32BaseFs::readBytesAt(path,
                                    static_cast<uint32_t>(size - 1U),
                                    &value,
                                    1,
                                    &readLen) &&
           readLen == 1;
}

void fsSendJsonBool(const char* name, bool value, bool comma = true) {
    if (comma) {
        sendChunk(",");
    }
    sendChunk("\"");
    sendChunk(name);
    sendChunk("\":");
    sendChunk(value ? "true" : "false");
}

void fsSendUploadJson(int code, bool ok, const char* error, const char* path, bool exists = false, bool isDir = false) {
    if (!beginResponse(code, "application/json", nullptr)) {
        return;
    }
    sendChunk("{\"ok\":");
    sendChunk(ok ? "true" : "false");
    fsSendJsonBool("exists", exists);
    fsSendJsonBool("directory", isDir);
    if (path && path[0]) {
        sendChunk(",\"path\":\"");
        sendEscapedJsonChunk(path);
        sendChunk("\"");
    }
    if (error && error[0]) {
        sendChunk(",\"error\":\"");
        sendEscapedJsonChunk(error);
        sendChunk("\"");
    }
    sendChunk("}");
    endResponse();
}

